
"event read status update" = "event read status update";

"device event status updated. The save" = "device event status updated. The save";

"Resolved" = "Resolved";
"Unresolved" = "Unresolved";


"The message status could not be updated" = "The message status could not be updated";

// K9 : event status update error message
"Your HP device has sent a status update. This update could not be saved in HP Utility - Message Center" = "Your HP device has sent a status update. This update could not be saved in HP Utility - Message Center";

"Messages could not be displayed in HP Utility - Message Center" = "Messages could not be displayed in HP Utility - Message Center";